buildingElementBC/validation/case1_steadyState/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    buildingWall
    {
        type            calculated;
        value           $internalField;
    }
    
    interior
    {
        type            calculated;
        value           $internalField;
    }
    
    topAndBottom
    {
        type            calculated;
        value           $internalField;
    }
    
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //