buildingElementBC/validation/case1_steadyState/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver          GAMG;
        smoother        DICGaussSeidel;
        tolerance       1e-08;
        relTol          0.01;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    "(U|h|k|epsilon)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       101325;
    
    residualControl
    {
        p_rgh           1e-3;
        U               1e-3;
        h               1e-3;
    }
    
    consistent      no;  // Turn off for better stability
    
    pMin            10000;
    pMax            200000;
}

relaxationFactors
{
    fields
    {
        rho             table ((0 0.01) (100 0.1) (300 0.3) (500 0.5));
        p_rgh           table ((0 0.000005) (100 0.01) (300 0.2) (500 0.3));
    }
    equations
    {
        U               table ((0 0.05) (100 0.1) (300 0.2) (500 0.3));
        h               table ((0 0.01) (100 0.05) (300 0.1) (500 0.3));
        k               table ((0 0.05) (100 0.1) (300 0.2) (500 0.3));
        epsilon         table ((0 0.05) (100 0.1) (300 0.2) (500 0.3));
    }
}

// ************************************************************************* //
